app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @coment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Sarah"], ["body", "This is my first comment"], ["article_id", 1], ["created_at", "2015-04-26 16:09:49.607906"], ["updated_at", "2015-04-26 16:09:49.607906"]]